<?php
//1. Реализовать основные 4 арифметические операции 
//в виде функции с тремя параметрами – два параметра это числа, третий – операция.
// Обязательно использовать оператор return.
$a=10;
$b=20;

function add(int $x, int $y):int {
    return $x+$y;
}
echo add($a,$b) . PHP_EOL;

function mult (int $x, int $y):int {
    return $x*$y;
}
echo mult($a,$b) . PHP_EOL;

function ded (int $x, int $y):int {
    return $x-$y;
}
echo ded($a,$b) . PHP_EOL;

function div (int $x, int $y): float|string {
    return $y==0 ? print("на ноль делить нельзя") : $x/$y;
}
echo div($a,$b) . PHP_EOL;

//2. Реализовать функцию с тремя параметрами:
// function mathOperation($arg1, $arg2, $operation),
// где $arg1, $arg2 – значения аргументов, $operation – строка с названием операции.
// В зависимости от переданного значения операции выполнить одну из арифметических
// операций (использовать функции из пункта 3) и вернуть полученное значение (использовать switch).
function mathOperation($arg1, $arg2, $operation) {
    switch ($operation){

        case "+":
        return print(add($arg1, $arg2));
        break;
        
        case "*":
        return print(mult($arg1, $arg2));
        break;
        
        case "-":
        return print(add($arg1, $arg2));
        break;
        
        case "/":
        return print(div($arg1, $arg2));
        break;

        default:echo "вы не верно ввели арифметическую операцию";
        }
    
}

mathOperation(2,5,"*");

//3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,
// а в качестве значений – массивы с названиями городов из соответствующей области. 
//Вывести в цикле значения массива, чтобы результат был таким:
// Московская область: Москва, Зеленоград, Клин Ленинградская область: 
//Санкт-Петербург, Всеволожск, Павловск, Кронштадт Рязанская область … 
//(названия городов можно найти на maps.yandex.ru).

$obl = ['Московская область' => ['Москва', 'Зеленоград', 'Клин'], 'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Кронштадт']];
foreach ($obl as $key => $value) {
    echo " ".$key.":";
        foreach ($value as $key => $value) {
            echo $value.", " ;
        }
    };

// 4. Объявить массив, индексами которого являются буквы русского языка, а 
//значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). 
//Написать функцию транслитерации строк.  

function interpreter(string $txt): string {
	

	$translit = ['а' => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "yo", "ж" => "zh", "з" => "z", "и" => "i", "й" => "i", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h", "ц" => "ts", "ч" => "ch", "ш" => "sh", "щ" => "sh", "ь" => "", "ы" => "y", "ъ" => "", "э" => "e", "ю" => "yu", "я" => "ya", " " => " "	];
	
	for ($i = 0; $i <= mb_strlen($txt) - 1; $i++) {
		$text.= $translit[mb_substr($txt,$i,1)];
	}
	
	return $text;
}

echo interpreter("на дворе дрова");